
{'idcard': '1-6699-00131-27-7'}

{'$set': {'addr': '400/55 หมู่111 '}, '$push': {'historyaddr': {'addr': '400/55 หมู่111 ', 'tumbol': 'สันทราย', 'scandate': datetime.datetime(2021, 10, 30, 10, 5, 54, 943977)}}}

{'idcard': '1-6699-00131-27-7'}

{'$set': [{'name': 'น.ส.ชิดชนก เทพอาชา'}, {'stlupdate': '26 เมษายน 2532'}, {'notes': 'บุคคลนี้มีภูมิลําเนาอยู่ในบ้านนี้'}, {'addr': '400/55 หมู่111 '},
 {'tumbol': 'สันทราย'}, {'aumphur': 'เมืองเชียงราย'}, {'province': 'เชียงราย'}, {'scandate': datetime.datetime(2021, 10, 30, 10, 5, 54, 944403)}],
  '$push': {'historyaddr': [{'name': 'น.ส.ชิดชนก เทพอาชา'}, {'stlupdate': '26 เมษายน 2532'}, {'notes': 'บุคคลนี้มีภูมิลําเนาอยู่ในบ้านนี้'},
   {'addr': '400/55 หมู่111 '}, {'tumbol': 'สันทราย'}, {'aumphur': 'เมืองเชียงราย'}, {'province': 'เชียงราย'}, 
   {'scandate': datetime.datetime(2021, 10, 30, 10, 5, 54, 944403)}]}}


{'idcard': '1-6699-00131-27-7'}

{'$set': {'addr': '400/55 หมู่111 '}, 

'$push': {'historyaddr': {'addr': '400/55 หมู่111 ', 'tumbol': 'สันทราย', 'scandate': datetime.datetime(2021, 10, 30, 10, 17, 0, 222271)}}}


{'idcard': '1-6699-00131-27-7'}

{'$set': {'name': 'น.ส.ชิดชนก เทพอาชา', 'stlupdate': '26 เมษายน 2532', 'notes': 'บุคคลนี้มีภูมิลําเนาอยู่ในบ้านนี้', 'addr': '400/55 หมู่111 ', 
'tumbol': 'สันทราย', 'aumphur': 'เมืองเชียงราย', 'province': 'เชียงราย', 'scandate': datetime.datetime(2021, 10, 30, 10, 17, 0, 222883)}, 

'$push': {'historyaddr': {'name': 'น.ส.ชิดชนก เทพอาชา', 'stlupdate': '26 เมษายน 2532', 'notes': 'บุคคลนี้มีภูมิลําเนาอยู่ในบ้านนี้', 'addr': '400/55 หมู่111 ',
 'tumbol': 'สันทราย', 'aumphur': 'เมืองเชียงราย', 'province': 'เชียงราย', 'scandate': datetime.datetime(2021, 10, 30, 10, 17, 0, 222883)}}}